----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 64, 64]           1,792
       BatchNorm2d-2           [-1, 64, 64, 64]             128
              GELU-3           [-1, 64, 64, 64]               0
            Conv2d-4           [-1, 64, 64, 64]          36,928
       BatchNorm2d-5           [-1, 64, 64, 64]             128
              GELU-6           [-1, 64, 64, 64]               0
 ResidualConvBlock-7           [-1, 64, 64, 64]               0
            Conv2d-8           [-1, 64, 64, 64]          36,928
       BatchNorm2d-9           [-1, 64, 64, 64]             128
             GELU-10           [-1, 64, 64, 64]               0
           Conv2d-11           [-1, 64, 64, 64]          36,928
      BatchNorm2d-12           [-1, 64, 64, 64]             128
             GELU-13           [-1, 64, 64, 64]               0
ResidualConvBlock-14           [-1, 64, 64, 64]               0
           Conv2d-15           [-1, 64, 64, 64]          36,928
      BatchNorm2d-16           [-1, 64, 64, 64]             128
             GELU-17           [-1, 64, 64, 64]               0
           Conv2d-18           [-1, 64, 64, 64]          36,928
      BatchNorm2d-19           [-1, 64, 64, 64]             128
             GELU-20           [-1, 64, 64, 64]               0
ResidualConvBlock-21           [-1, 64, 64, 64]               0
        MaxPool2d-22           [-1, 64, 32, 32]               0
         UnetDown-23           [-1, 64, 32, 32]               0
           Conv2d-24          [-1, 128, 32, 32]          73,856
      BatchNorm2d-25          [-1, 128, 32, 32]             256
             GELU-26          [-1, 128, 32, 32]               0
           Conv2d-27          [-1, 128, 32, 32]         147,584
      BatchNorm2d-28          [-1, 128, 32, 32]             256
             GELU-29          [-1, 128, 32, 32]               0
ResidualConvBlock-30          [-1, 128, 32, 32]               0
           Conv2d-31          [-1, 128, 32, 32]         147,584
      BatchNorm2d-32          [-1, 128, 32, 32]             256
             GELU-33          [-1, 128, 32, 32]               0
           Conv2d-34          [-1, 128, 32, 32]         147,584
      BatchNorm2d-35          [-1, 128, 32, 32]             256
             GELU-36          [-1, 128, 32, 32]               0
ResidualConvBlock-37          [-1, 128, 32, 32]               0
        MaxPool2d-38          [-1, 128, 16, 16]               0
         UnetDown-39          [-1, 128, 16, 16]               0
        AvgPool2d-40            [-1, 128, 1, 1]               0
             GELU-41            [-1, 128, 1, 1]               0
           Linear-42                  [-1, 128]             256
             GELU-43                  [-1, 128]               0
           Linear-44                  [-1, 128]          16,512
          EmbedFC-45                  [-1, 128]               0
           Linear-46                   [-1, 64]             128
             GELU-47                   [-1, 64]               0
           Linear-48                   [-1, 64]           4,160
          EmbedFC-49                   [-1, 64]               0
  ConvTranspose2d-50          [-1, 128, 16, 16]       4,194,432
        GroupNorm-51          [-1, 128, 16, 16]             256
             ReLU-52          [-1, 128, 16, 16]               0
  ConvTranspose2d-53           [-1, 64, 32, 32]          65,600
           Conv2d-54           [-1, 64, 32, 32]          36,928
      BatchNorm2d-55           [-1, 64, 32, 32]             128
             GELU-56           [-1, 64, 32, 32]               0
           Conv2d-57           [-1, 64, 32, 32]          36,928
      BatchNorm2d-58           [-1, 64, 32, 32]             128
             GELU-59           [-1, 64, 32, 32]               0
ResidualConvBlock-60           [-1, 64, 32, 32]               0
           Conv2d-61           [-1, 64, 32, 32]          36,928
      BatchNorm2d-62           [-1, 64, 32, 32]             128
             GELU-63           [-1, 64, 32, 32]               0
           Conv2d-64           [-1, 64, 32, 32]          36,928
      BatchNorm2d-65           [-1, 64, 32, 32]             128
             GELU-66           [-1, 64, 32, 32]               0
ResidualConvBlock-67           [-1, 64, 32, 32]               0
           UnetUp-68           [-1, 64, 32, 32]               0
  ConvTranspose2d-69           [-1, 64, 64, 64]          32,832
           Conv2d-70           [-1, 64, 64, 64]          36,928
      BatchNorm2d-71           [-1, 64, 64, 64]             128
             GELU-72           [-1, 64, 64, 64]               0
           Conv2d-73           [-1, 64, 64, 64]          36,928
      BatchNorm2d-74           [-1, 64, 64, 64]             128
             GELU-75           [-1, 64, 64, 64]               0
ResidualConvBlock-76           [-1, 64, 64, 64]               0
           Conv2d-77           [-1, 64, 64, 64]          36,928
      BatchNorm2d-78           [-1, 64, 64, 64]             128
             GELU-79           [-1, 64, 64, 64]               0
           Conv2d-80           [-1, 64, 64, 64]          36,928
      BatchNorm2d-81           [-1, 64, 64, 64]             128
             GELU-82           [-1, 64, 64, 64]               0
ResidualConvBlock-83           [-1, 64, 64, 64]               0
           UnetUp-84           [-1, 64, 64, 64]               0
           Conv2d-85           [-1, 64, 64, 64]          73,792
        GroupNorm-86           [-1, 64, 64, 64]             128
             ReLU-87           [-1, 64, 64, 64]               0
           Conv2d-88            [-1, 3, 64, 64]           1,731
      ContextUnet-89            [-1, 3, 64, 64]               0
================================================================
Total params: 5,391,107
Trainable params: 5,391,107
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 104.45
Params size (MB): 20.57
Estimated Total Size (MB): 125.06
----------------------------------------------------------------